Бухгалтерские_задачи_Финиш/src/Documents/КурсоваяРазница/КурсоваяРазница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурсоваяРазница</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
</mdclass:Document>

Бухгалтерские_задачи_Финиш/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Счета.ExtDimensionAccountingFlag._Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Счета.ExtDimensionAccountingFlag._Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВалюты</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаМСФО</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Финиш/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
    <items>
      <name>ВалютныйСчетВБанке</name>
      <description>Валютный счет в банке</description>
      <code>52</code>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>_Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>_Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Финиш/src/Documents/КурсоваяРазница/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Блокировка = Новый БлокировкаДанных;
	
	ЧтоБлокируем = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	
	ЧтоБлокируем.УстановитьЗначение("Счет", ПланыСчетов.Счета.Поставщики);
	
	Блокировка.Заблокировать();
	
	
	Движения.Проводки.Записывать = Истина;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкиОстатки.Счет,
		|	ПроводкиОстатки.Субконто1,
		|	ПроводкиОстатки.Субконто2,
		|	ПроводкиОстатки.Организация,
		|	ПроводкиОстатки.Подразделение,
		|	ПроводкиОстатки.Валюта,
		|	ПроводкиОстатки.СуммаОстатокДт,
		|	ПроводкиОстатки.СуммаОстатокКт,
		|	ПроводкиОстатки.СуммаВалютыОстатокДт,
		|	ПроводкиОстатки.СуммаВалютыОстатокКт
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет.Валютный = ИСТИНА, , Валюта <> &ПустаяВалюта и Валюта <> &НацВалюта) КАК ПроводкиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта,
		|	КурсыВалютСрезПоследних.Курс
		|ПОМЕСТИТЬ ВТКурс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			&Период,
		|			Валюта В
		|				(ВЫБРАТЬ
		|					ВТОстатки.Валюта
		|				ИЗ
		|					ВТОстатки КАК ВТОстатки)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстатки.Счет,
		|	ВТОстатки.Субконто1,
		|	ВТОстатки.Субконто2,
		|	ВТОстатки.Организация,
		|	ВТОстатки.Подразделение,
		|	ВТОстатки.Валюта,
		|	ВТОстатки.СуммаОстатокДт,
		|	ВТОстатки.СуммаОстатокКт,
		|	ВТОстатки.СуммаВалютыОстатокДт,
		|	ВТОстатки.СуммаВалютыОстатокКт,
		|	ЕСТЬNULL(ВТКурс.Курс, 1) КАК Курс
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурс КАК ВТКурс
		|		ПО ВТОстатки.Валюта = ВТКурс.Валюта";
	
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("ПустаяВалюта", ПланыСчетов.Счета.ПустаяСсылка());
	Запрос.УстановитьПараметр("НацВалюта", Справочники.Валюты.РубльРФ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВалютаОстатокДт = ВыборкаДетальныеЗаписи.СуммаВалютыОстатокДт;
		
		ВалютаОстатокКт = ВыборкаДетальныеЗаписи.СуммаВалютыОстатокКт;
		
		
		СальдоРублиДт = ВалютаОстатокДт * ВыборкаДетальныеЗаписи.Курс;
		
		СальдоРублиКт = ВалютаОстатокКт * ВыборкаДетальныеЗаписи.Курс;
		
		Если СальдоРублиКт > 0 Тогда
			
			КурсоваяРазница =  СальдоРублиКт - ВыборкаДетальныеЗаписи.СуммаОстатокКт + ВыборкаДетальныеЗаписи.СуммаОстатокДт ;
			
			Если КурсоваяРазница > 0 Тогда
				
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма = КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ВыборкаДетальныеЗаписи.Счет;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
			Иначе
				
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма = -1 * КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ВыборкаДетальныеЗаписи.Счет;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
			КонецЕсли;
			
		Иначе
			
			КурсоваяРазница =  СальдоРублиДт - ВыборкаДетальныеЗаписи.СуммаОстатокДт + ВыборкаДетальныеЗаписи.СуммаОстатокКт ;
			
			Если КурсоваяРазница > 0 Тогда
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма = КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ВыборкаДетальныеЗаписи.Счет;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
				
			Иначе
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма =  -1 *КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ВыборкаДетальныеЗаписи.Счет;
				
				Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				Бухгалтерия.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	КонецЦикла;

	Движения.Проводки.Записывать = Истина;
	
	
	
КонецПроцедуры
